{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "ruangrasa_reasonable_multitask_screening_model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "string", "sparse": false, "ragged": false, "name": "Gender", "optional": false}, "registered_name": null, "name": "Gender", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Age", "optional": false}, "registered_name": null, "name": "Age", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Sleep_Hours_Night", "optional": false}, "registered_name": null, "name": "Sleep_Hours_Night", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Screen_Time_Hours_Day", "optional": false}, "registered_name": null, "name": "Screen_Time_Hours_Day", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Social_Media_Hours_Day", "optional": false}, "registered_name": null, "name": "Social_Media_Hours_Day", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Trauma_History", "optional": false}, "registered_name": null, "name": "Trauma_History", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Previously_Diagnosed", "optional": false}, "registered_name": null, "name": "Previously_Diagnosed", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Work_Hours_Per_Week", "optional": false}, "registered_name": null, "name": "Work_Hours_Per_Week", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Work_Stress_Level", "optional": false}, "registered_name": null, "name": "Work_Stress_Level", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Financial_Stress", "optional": false}, "registered_name": null, "name": "Financial_Stress", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Mood_Swings", "optional": false}, "registered_name": null, "name": "Mood_Swings", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "Loneliness", "optional": false}, "registered_name": null, "name": "Loneliness", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "screening_hour", "optional": false}, "registered_name": null, "name": "screening_hour", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "screening_dayofweek", "optional": false}, "registered_name": null, "name": "screening_dayofweek", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "screening_month", "optional": false}, "registered_name": null, "name": "screening_month", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "sleep_risk", "optional": false}, "registered_name": null, "name": "sleep_risk", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "screen_time_risk", "optional": false}, "registered_name": null, "name": "screen_time_risk", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "social_media_risk", "optional": false}, "registered_name": null, "name": "social_media_risk", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "work_hours_risk", "optional": false}, "registered_name": null, "name": "work_hours_risk", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "work_stress_risk", "optional": false}, "registered_name": null, "name": "work_stress_risk", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "financial_risk", "optional": false}, "registered_name": null, "name": "financial_risk", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "mood_swings_risk", "optional": false}, "registered_name": null, "name": "mood_swings_risk", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "loneliness_risk", "optional": false}, "registered_name": null, "name": "loneliness_risk", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "StringLookup", "config": {"name": "Gender_lookup", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "invert": false, "max_tokens": null, "num_oov_indices": 1, "oov_token": "[UNK]", "mask_token": null, "output_mode": "one_hot", "sparse": false, "pad_to_max_tokens": false, "idf_weights": null, "vocabulary": null, "vocabulary_size": 5, "encoding": "utf-8"}, "registered_name": null, "build_config": {}, "name": "Gender_lookup", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "string", "keras_history": ["Gender", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "Age_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "Age_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Age", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "Sleep_Hours_Night_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "Sleep_Hours_Night_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Sleep_Hours_Night", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "Screen_Time_Hours_Day_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "Screen_Time_Hours_Day_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Screen_Time_Hours_Day", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "Social_Media_Hours_Day_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "Social_Media_Hours_Day_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Social_Media_Hours_Day", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "Trauma_History_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "Trauma_History_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Trauma_History", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "Previously_Diagnosed_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "Previously_Diagnosed_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Previously_Diagnosed", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "Work_Hours_Per_Week_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "Work_Hours_Per_Week_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Work_Hours_Per_Week", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "Work_Stress_Level_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "Work_Stress_Level_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Work_Stress_Level", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "Financial_Stress_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "Financial_Stress_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Financial_Stress", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "Mood_Swings_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "Mood_Swings_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Mood_Swings", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "Loneliness_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "Loneliness_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Loneliness", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "screening_hour_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "screening_hour_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["screening_hour", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "screening_dayofweek_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "screening_dayofweek_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["screening_dayofweek", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "screening_month_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "screening_month_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["screening_month", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "sleep_risk_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "sleep_risk_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["sleep_risk", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "screen_time_risk_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "screen_time_risk_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["screen_time_risk", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "social_media_risk_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "social_media_risk_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["social_media_risk", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "work_hours_risk_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "work_hours_risk_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["work_hours_risk", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "work_stress_risk_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "work_stress_risk_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["work_stress_risk", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "financial_risk_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "financial_risk_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["financial_risk", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "mood_swings_risk_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "mood_swings_risk_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["mood_swings_risk", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "loneliness_risk_norm", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": [], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [7000, 1]}, "name": "loneliness_risk_norm", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["loneliness_risk", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 5]}, "name": "flatten", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 5], "dtype": "float32", "keras_history": ["Gender_lookup", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concat_features", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 1], [null, 5]]}, "name": "concat_features", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Age_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Sleep_Hours_Night_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Screen_Time_Hours_Day_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Social_Media_Hours_Day_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Trauma_History_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Previously_Diagnosed_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Work_Hours_Per_Week_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Work_Stress_Level_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Financial_Stress_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Mood_Swings_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["Loneliness_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["screening_hour_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["screening_dayofweek_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["screening_month_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["sleep_risk_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["screen_time_risk_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["social_media_risk_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["work_hours_risk_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["work_stress_risk_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["financial_risk_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["mood_swings_risk_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 1], "dtype": "float32", "keras_history": ["loneliness_risk_norm", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 5], "dtype": "float32", "keras_history": ["flatten", 0, 0]}}]], "kwargs": {}}]}, {"module": null, "class_name": "FeatureAttention", "config": {"name": "feature_attention", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "units": 16}, "registered_name": "RuangRasa>FeatureAttention", "build_config": {"input_shape": [null, 27]}, "name": "feature_attention", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 27], "dtype": "float32", "keras_history": ["concat_features", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "encoder_dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 27]}, "name": "encoder_dense_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 27], "dtype": "float32", "keras_history": ["feature_attention", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "encoder_bn_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "encoder_bn_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["encoder_dense_1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "encoder_dropout_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "rate": 0.3, "seed": null, "noise_shape": null}, "registered_name": null, "name": "encoder_dropout_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["encoder_bn_1", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "encoder_dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "encoder_dense_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["encoder_dropout_1", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "encoder_bn_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "encoder_bn_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["encoder_dense_2", 0, 0]}}], "kwargs": {"mask": null}}]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "encoder_dropout_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "rate": 0.2, "seed": null, "noise_shape": null}, "registered_name": null, "name": "encoder_dropout_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["encoder_bn_2", 0, 0]}}], "kwargs": {"training": false}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "latent_user_embedding", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 64]}, "name": "latent_user_embedding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 64], "dtype": "float32", "keras_history": ["encoder_dropout_2", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "reconstruction", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "units": 22, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "reconstruction", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32], "dtype": "float32", "keras_history": ["latent_user_embedding", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "risk_class", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "risk_class", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32], "dtype": "float32", "keras_history": ["latent_user_embedding", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "risk_score", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "risk_score", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32], "dtype": "float32", "keras_history": ["latent_user_embedding", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "user_profile", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null, "shared_object_id": 137394541227632}, "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "quantization_config": null}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "user_profile", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32], "dtype": "float32", "keras_history": ["latent_user_embedding", 0, 0]}}], "kwargs": {}}]}], "input_layers": {"Age": ["Age", 0, 0], "Sleep_Hours_Night": ["Sleep_Hours_Night", 0, 0], "Screen_Time_Hours_Day": ["Screen_Time_Hours_Day", 0, 0], "Social_Media_Hours_Day": ["Social_Media_Hours_Day", 0, 0], "Trauma_History": ["Trauma_History", 0, 0], "Previously_Diagnosed": ["Previously_Diagnosed", 0, 0], "Work_Hours_Per_Week": ["Work_Hours_Per_Week", 0, 0], "Work_Stress_Level": ["Work_Stress_Level", 0, 0], "Financial_Stress": ["Financial_Stress", 0, 0], "Mood_Swings": ["Mood_Swings", 0, 0], "Loneliness": ["Loneliness", 0, 0], "screening_hour": ["screening_hour", 0, 0], "screening_dayofweek": ["screening_dayofweek", 0, 0], "screening_month": ["screening_month", 0, 0], "sleep_risk": ["sleep_risk", 0, 0], "screen_time_risk": ["screen_time_risk", 0, 0], "social_media_risk": ["social_media_risk", 0, 0], "work_hours_risk": ["work_hours_risk", 0, 0], "work_stress_risk": ["work_stress_risk", 0, 0], "financial_risk": ["financial_risk", 0, 0], "mood_swings_risk": ["mood_swings_risk", 0, 0], "loneliness_risk": ["loneliness_risk", 0, 0], "Gender": ["Gender", 0, 0]}, "output_layers": {"risk_class": ["risk_class", 0, 0], "risk_score": ["risk_score", 0, 0], "user_profile": ["user_profile", 0, 0], "reconstruction": ["reconstruction", 0, 0]}}, "registered_name": "Functional", "build_config": {"input_shape": null}, "compile_config": {}}